//
//  savingpage.swift
//  newsongtime
//
//  Created by Cherish Park on 12/26/19.
//  Copyright © 2019 Newsong church. All rights reserved.
//

import UIKit
import Firebase

class saving: UIViewController {
    
    @IBOutlet weak var segmentedToggle: UISegmentedControl!
    @IBOutlet weak var savingTextField: UITextField!
    @IBOutlet weak var savingKor: UIView!
    @IBOutlet weak var savingEng: UIView!
    @IBOutlet weak var textViewQT: UITextView!
    @IBOutlet weak var recordPath: UIButton!

    
    var savingSchedule_kor = [
        // 2020 년
        // 1 월
        "01_01":"잠언 1장", "01_02":"잠언 2장", "01_03":"잠언 3장", "01_04":"잠언 4장",
        "01_05":"잠언 5장", "01_06":"잠언 6장", "01_07":"잠언 7장", "01_08":"잠언 8장",
        "01_09":"잠언 9장", "01_10":"잠언 10장", "01_11":"잠언 11장", "01_12":"잠언 12장",
        "01_13":"잠언 13장", "01_14":"잠언 14장", "01_15":"잠언 15장", "01_16":"잠언 16장",
        "01_17":"잠언 17장", "01_18":"잠언 18장", "01_19":"잠언 19장", "01_20":"잠언 20장",
        "01_21":"잠언 21장", "01_22":"잠언 22장", "01_23":"잠언 23장", "01_24":"잠언 24장",
        "01_25":"잠언 25장", "01_26":"잠언 26장", "01_27":"잠언 27장", "01_28":"잠언 28장",
        "01_29":"잠언 29장", "01_30":"잠언 30장", "01_31":"잠언 31장",
        
        // 2 월
        "02_01":"사도행전 1장", "02_02":"사도행전 2장", "02_03":"사도행전 3장",
        "02_04":"사도행전 4장", "02_05":"사도행전 5장", "02_06":"사도행전 6장",
        "02_07":"사도행전 7장", "02_08":"사도행전 8장", "02_09":"사도행전 9장",
        "02_10":"사도행전 10장", "02_11":"사도행전 11장", "02_12":"사도행전 12장",
        "02_13":"사도행전 13장", "02_14":"사도행전 14장", "02_15":"사도행전 15장",
        "02_16":"사도행전 16장", "02_17":"사도행전 17장", "02_18":"사도행전 18장",
        "02_19":"사도행전 19장", "02_20":"사도행전 20장", "02_21":"사도행전 21장",
        "02_22":"사도행전 22장", "02_23":"사도행전 23장", "02_24":"사도행전 24장",
        "02_25":"사도행전 25장", "02_26":"사도행전 26장", "02_27":"사도행전 27장",
        "02_28":"사도행전 28장", "02_29":"로마서 1장",
        
        // 3 월
        "03_01":"로마서 2장", "03_02":"로마서 3장", "03_03":"로마서 4장", "03_04":"로마서 5장",
        "03_05":"로마서 6장", "03_06":"로마서 7장", "03_07":"로마서 8장", "03_08":"로마서 9장",
        "03_09":"로마서 10장", "03_10":"로마서 11장", "03_11":"로마서 12장", "03_12":"로마서 13장",
        "03_13":"로마서 14장", "03_14":"로마서 15장", "03_15":"로마서 16장", "03_16":"고린도전서 1장",
        "03_17":"고린도전서 2장", "03_18":"고린도전서 3장", "03_19":"고린도전서 4장", "03_20":"고린도전서 5장",
        "03_21":"고린도전서 6장", "03_22":"고린도전서 7장", "03_23":"고린도전서 8장", "03_24":"고린도전서 9장",
        "03_25":"고린도전서 10장", "03_26":"고린도전서 11장", "03_27":"고린도전서 12장", "03_28":"고린도전서 13장",
        "03_29":"고린도전서 14장", "03_30":"고린도전서 15장", "03_31":"고린도전서 16장",
        
        // 4 월
        "04_01":"고린도후서 1장", "04_02":"고린도후서 2장", "04_03":"고린도후서 3장", "04_04":"고린도후서 4장",
        "04_05":"고린도후서 5장", "04_06":"고린도후서 6장", "04_07":"고린도후서 7장", "04_08":"고린도후서 8장",
        "04_09":"고린도후서 9장", "04_10":"고린도후서 10장", "04_11":"고린도후서 11장", "04_12":"고린도후서 12장",
        "04_13":"고린도후서 13장", "04_14":"갈라디아서 1장", "04_15":"갈라디아서 2장", "04_16":"갈라디아서 3장",
        "04_17":"갈라디아서 4장", "04_18":"갈라디아서 5장", "04_19":"갈라디아서 6장", "04_20":"에베소서 1장",
        "04_21":"에베소서 2장", "04_22":"에베소서 3장", "04_23":"에베소서 4장", "04_24":"에베소서 5장",
        "04_25":"에베소서 6장", "04_26":"빌립보서 1장", "04_27":"빌립보서 2장", "04_28":"빌립보서 3장",
        "04_29":"빌립보서 4장", "04_30":"골로새서 1장",
        
        // 5 월
        "05_01":"골로새서 2장", "05_02":"골로새서 3장", "05_03":"골로새서 4장", "05_04":"데살로니가전서 1장",
        "05_05":"데살로니가전서 2장", "05_06":"데살로니가전서 3장", "05_07":"데살로니가전서 4장", "05_08":"데살로니가전서 5장",
        "05_09":"데살로니가후서 1장", "05_10":"데살로니가후서 2장", "05_11":"데살로니가후서 3장", "05_12":"디모데전서 1장",
        "05_13":"디모데전서 2장", "05_14":"디모데전서 3장", "05_15":"디모데전서 4장", "05_16":"디모데전서 5장",
        "05_17":"디모데전서 6장", "05_18":"디모데후서 1장", "05_19":"디모데후서 2장", "05_20":"디모데후서 3장",
        "05_21":"디모데후서 4장", "05_22":"디도서 1장", "05_23":"디도서 2장", "05_24":"디도서 3장",
        "05_25":"빌레몬서 1장", "05_26":"히브리서 1장", "05_27":"히브리서 2장", "05_28":"히브리서 3장",
        "05_29":"히브리서 4장", "05_30":"히브리서 5장", "05_31":"히브리서 6장",
        
        // 6 월
        "06_01":"히브리서 7장", "06_02":"히브리서 8장", "06_03":"히브리서 9장", "06_04":"히브리서 10장",
        "06_05":"히브리서 11장", "06_06":"히브리서 12장", "06_07":"히브리서 13장", "06_08":"야고보서 1장",
        "06_09":"야고보서 2장", "06_10":"야고보서 3장", "06_11":"야고보서 4장", "06_12":"야고보서 5장",
        "06_13":"베드로전서 1장", "06_14":"베드로전서 2장", "06_15":"베드로전서 3장", "06_16":"베드로전서 4장",
        "06_17":"베드로전서 5장", "06_18":"베드로후서 1장", "06_19":"베드로후서 2장", "06_20":"베드로후서 3장",
        "06_21":"요한일서 1장", "06_22":"요한일서 2장", "06_23":"요한일서 3장", "06_24":"요한일서 4장",
        "06_25":"요한일서 5장", "06_26":"요한이서 1장", "06_27":"요한삼서 1장", "06_28":"유다서 1장",
        "06_29":"요한계시록 1장", "06_30":"요한계시록 2장",
        
        // 7 월
        "07_01":"요한계시록 3장", "07_02":"요한계시록 4장", "07_03":"요한계시록 5장", "07_04":"요한계시록 6장",
        "07_05":"요한계시록 7장", "07_06":"요한계시록 8장", "07_07":"요한계시록 9장", "07_08":"요한계시록 10장",
        "07_09":"요한계시록 11장", "07_10":"요한계시록 12장", "07_11":"요한계시록 13장", "07_12":"요한계시록 14장",
        "07_13":"요한계시록 15장", "07_14":"요한계시록 16장", "07_15":"요한계시록 17장", "07_16":"요한계시록 18장",
        "07_17":"요한계시록 19장", "07_18":"요한계시록 20장", "07_19":"요한계시록 21", "07_20":"요한계시록 22장",
        "07_21":"마태복음 1장", "07_22":"마태복음 2장", "07_23":"마태복음 3장", "07_24":"마태복음 4장",
        "07_25":"마태복음 5장", "07_26":"마태복음 6장", "07_27":"마태복음 7장", "07_28":"마태복음 8장",
        "07_29":"마태복음 9장", "07_30":"마태복음 10장", "07_31":"마태복음 11장",
        
        // 8 월
        "08_01":"마태복음 12장", "08_02":"마태복음 13장", "08_03":"마태복음 14장", "08_04":"마태복음 15장",
        "08_05":"마태복음 16장", "08_06":"마태복음 17장", "08_07":"마태복음 18장", "08_08":"마태복음 19장",
        "08_09":"마태복음 20장", "08_10":"마태복음 21장", "08_11":"마태복음 22장", "08_12":"마태복음 23장",
        "08_13":"마태복음 24장", "08_14":"마태복음 25장", "08_15":"마태복음 26장", "08_16":"마태복음 27장",
        "08_17":"마태복음 28장", "08_18":"마가복음 1장", "08_19":"마가복음 2장", "08_20":"마가복음 3장",
        "08_21":"마가복음 4장", "08_22":"마가복음 5장", "08_23":"마가복음 6장", "08_24":"마가복음 7장",
        "08_25":"마가복음 8장", "08_26":"마가복음 9장", "08_27":"마가복음 10장", "08_28":"마가복음 11장",
        "08_29":"마가복음 12장", "08_30":"마가복음 13장", "08_31":"마가복음 14장",
        
        // 9 월
        "09_01":"마가복음 15장", "09_02":"마가복음 16장", "09_03":"누가복음 1장", "09_04":"누가복음 2장",
        "09_05":"누가복음 3장", "09_06":"누가복음 4장", "09_07":"누가복음 5장", "09_08":"누가복음 6장",
        "09_09":"누가복음 7장", "09_10":"누가복음 8장", "09_11":"누가복음 9장", "09_12":"누가복음 10장",
        "09_13":"누가복음 11장", "09_14":"누가복음 12장", "09_15":"누가복음 13장", "09_16":"누가복음 14장",
        "09_17":"누가복음 15장", "09_18":"누가복음 16장", "09_19":"누가복음 17장", "09_20":"누가복음 18장",
        "09_21":"누가복음 19장", "09_22":"누가복음 20장", "09_23":"누가복음 21장", "09_24":"누가복음 22장",
        "09_25":"누가복음 23장", "09_26":"누가복음 24장", "09_27":"요한복음 1장", "09_28":"요한복음 2장",
        "09_29":"요한복음 3장", "09_30":"요한복음 4장",
        
        // 10 월
        "10_01":"요한복음 5장", "10_02":"요한복음 6장", "10_03":"요한복음 7장", "10_04":"요한복음 8장",
        "10_05":"요한복음 9장", "10_06":"요한복음 10장", "10_07":"요한복음 11장", "10_08":"요한복음 12장",
        "10_09":"요한복음 13장", "10_10":"요한복음 14장", "10_11":"요한복음 15장", "10_12":"요한복음 16장",
        "10_13":"요한복음 17장", "10_14":"요한복음 18장", "10_15":"요한복음 19장", "10_16":"요한복음 20장",
        "10_17":"요한복음 21장", "10_18":"창세기 1장", "10_19":"창세기 2장", "10_20":"창세기 3장",
        "10_21":"창세기 4장", "10_22":"창세기 5장", "10_23":"창세기 6장", "10_24":"창세기 7장",
        "10_25":"창세기 8장", "10_26":"창세기 9장", "10_27":"창세기 10장", "10_28":"창세기 11장",
        "10_29":"창세기 12장", "10_30":"창세기 13장", "10_31":"창세기 14장",
        
        // 11 월
        "11_01":"창세기 15장", "11_02":"창세기 16장", "11_03":"창세기 17장", "11_04":"창세기 18장",
        "11_05":"창세기 19장", "11_06":"창세기 20장", "11_07":"창세기 21장", "11_08":"창세기 22장",
        "11_09":"창세기 23장", "11_10":"창세기 24장", "11_11":"창세기 25장", "11_12":"창세기 26장",
        "11_13":"창세기 27장", "11_14":"창세기 28장", "11_15":"창세기 29장", "11_16":"창세기 30장",
        "11_17":"창세기 31장", "11_18":"창세기 32장", "11_19":"창세기 33장", "11_20":"창세기 34장",
        "11_21":"창세기 35장", "11_22":"창세기 36장", "11_23":"창세기 37장", "11_24":"창세기 38장",
        "11_25":"창세기 39장", "11_26":"창세기 40장", "11_27":"창세기 41장", "11_28":"창세기 42장",
        "11_29":"창세기 43장", "11_30":"창세기 44장",
        
        // 12 월
        "12_01": "창세기 45장", "12_02": "창세기 46장", "12_03": "창세기 47장", "12_04": "창세기 48장",
        "12_05": "창세기 49장", "12_06": "창세기 50장", "12_07": "출애굽기 1장", "12_08": "출애굽기 2장",
        "12_09": "출애굽기 3장", "12_10": "출애굽기 4장", "12_11": "출애굽기 5장", "12_12": "출애굽기 6장",
        "12_13": "출애굽기 7장", "12_14": "출애굽기 8장", "12_15": "출애굽기 9장", "12_16": "출애굽기 10장",
        "12_17": "출애굽기 11장", "12_18": "출애굽기 12장", "12_19": "출애굽기 13장", "12_20": "출애굽기 14장",
        "12_21": "출애굽기 15장", "12_22": "출애굽기 16장", "12_23": "출애굽기 17장", "12_24": "출애굽기 18장",
        "12_25": "출애굽기 19장", "12_26": "출애굽기 20장", "12_27": "출애굽기 21장", "12_28": "출애굽기 22장",
        "12_29": "출애굽기 23장", "12_30": "출애굽기 24장", "12_31": "출애굽기 25장",
    ]
    var savingSchedule_eng = [
        
        // 2020 년
        // 1 월
        "01_01":"Proverbs 1", "01_02":"Proverbs 2", "01_03":"Proverbs 3", "01_04":"Proverbs 4",
        "01_05":"Proverbs 5", "01_06":"Proverbs 6", "01_07":"Proverbs 7", "01_08":"Proverbs 8",
        "01_09":"Proverbs 9", "01_10":"Proverbs 10", "01_11":"Proverbs 11", "01_12":"Proverbs 12",
        "01_13":"Proverbs 13", "01_14":"Proverbs 14", "01_15":"Proverbs 15", "01_16":"Proverbs 16",
        "01_17":"Proverbs 17", "01_18":"Proverbs 18", "01_19":"Proverbs 19", "01_20":"Proverbs 20",
        "01_21":"Proverbs 21", "01_22":"Proverbs 22", "01_23":"Proverbs 23", "01_24":"Proverbs 24",
        "01_25":"Proverbs 25", "01_26":"Proverbs 26", "01_27":"Proverbs 27", "01_28":"Proverbs 28",
        "01_29":"Proverbs 29", "01_30":"Proverbs 30", "01_31":"Proverbs 31",
        
        // 2 월
        "02_01":"Acts 1", "02_02":"Acts 2", "02_03":"Acts 3",
        "02_04":"Acts 4", "02_05":"Acts 5", "02_06":"Acts 6",
        "02_07":"Acts 7", "02_08":"Acts 8", "02_09":"Acts 9",
        "02_10":"Acts 10", "02_11":"Acts 11", "02_12":"Acts 12",
        "02_13":"Acts 13", "02_14":"Acts 14", "02_15":"Acts 15",
        "02_16":"Acts 16", "02_17":"Acts 17", "02_18":"Acts 18",
        "02_19":"Acts 19", "02_20":"Acts 20", "02_21":"Acts 21",
        "02_22":"Acts 22", "02_23":"Acts 23", "02_24":"Acts 24",
        "02_25":"Acts 25", "02_26":"Acts 26", "02_27":"Acts 27",
        "02_28":"Acts 28", "02_29":"Romans 1",
        
        // 3 월
        "03_01":"Romans 2", "03_02":"Romans 3", "03_03":"Romans 4", "03_04":"Romans 5",
        "03_05":"Romans 6", "03_06":"Romans 7", "03_07":"Romans 8", "03_08":"Romans 9",
        "03_09":"Romans 10", "03_10":"Romans 11", "03_11":"Romans 12", "03_12":"Romans 13",
        "03_13":"Romans 14", "03_14":"Romans 15", "03_15":"Romans 16", "03_16":"1Corinthians 1",
        "03_17":"1Corinthians 2", "03_18":"1Corinthians 3", "03_19":"1Corinthians 4", "03_20":"1Corinthians 5",
        "03_21":"1Corinthians 6", "03_22":"1Corinthians 7", "03_23":"1Corinthians 8", "03_24":"1Corinthians 9",
        "03_25":"1Corinthians 10", "03_26":"1Corinthians 11", "03_27":"1Corinthians 12", "03_28":"1Corinthians 13",
        "03_29":"1Corinthians 14", "03_30":"1Corinthians 15", "03_31":"1Corinthians 16",
        
        // 4 월
        "04_01":"2Corinthians 1", "04_02":"2Corinthians 2", "04_03":"2Corinthians 3", "04_04":"2Corinthians 4",
        "04_05":"2Corinthians 5", "04_06":"2Corinthians 6", "04_07":"2Corinthians 7", "04_08":"2Corinthians 8",
        "04_09":"2Corinthians 9", "04_10":"2Corinthians 10", "04_11":"2Corinthians 11", "04_12":"2Corinthians 12",
        "04_13":"2Corinthians 13장", "04_14":"Galatians 1", "04_15":"Galatians 2", "04_16":"Galatians 3",
        "04_17":"Galatians 4", "04_18":"Galatians 5", "04_19":"Galatians 6", "04_20":"Ephesians 1",
        "04_21":"Ephesians 2", "04_22":"Ephesians 3", "04_23":"Ephesians 4", "04_24":"Ephesians 5",
        "04_25":"Ephesians 6", "04_26":"Philippians 1", "04_27":"Philippians 2", "04_28":"Philippians 3",
        "04_29":"Philippians 4", "04_30":"Colossians 1",
        
        // 5 월
        "05_01":"Colossians 2", "05_02":"Colossians 3", "05_03":"Colossians 4", "05_04":"1Thessalonians 1",
        "05_05":"1Thessalonians 2", "05_06":"1Thessalonians 3", "05_07":"1Thessalonians 4", "05_08":"1Thessalonians 5",
        "05_09":"2Thessalonians 1", "05_10":"2Thessalonians 2", "05_11":"2Thessalonians 3", "05_12":"1Timothy 1",
        "05_13":"1Timothy 2", "05_14":"1Timothy 3", "05_15":"1Timothy 4", "05_16":"1Timothy 5",
        "05_17":"1Timothy 6", "05_18":"2Timothy 1", "05_19":"2Timothy 2", "05_20":"2Timothy 3",
        "05_21":"2Timothy 4", "05_22":"Titus 1", "05_23":"Titus 2", "05_24":"Titus 3",
        "05_25":"Philemon 1", "05_26":"Hebrews 1", "05_27":"Hebrews 2", "05_28":"Hebrews 3",
        "05_29":"Hebrews 4", "05_30":"Hebrews 5", "05_31":"Hebrews 6",
        
        // 6 월
        "06_01":"Hebrews 7", "06_02":"Hebrews 8", "06_03":"Hebrews 9", "06_04":"Hebrews 10",
        "06_05":"Hebrews 11", "06_06":"Hebrews 12", "06_07":"Hebrews 13", "06_08":"James 1",
        "06_09":"James 2", "06_10":"James 3", "06_11":"James 4", "06_12":"James 5",
        "06_13":"1Peter 1", "06_14":"1Peter 2", "06_15":"1Peter 3", "06_16":"1Peter 4",
        "06_17":"1Peter 5", "06_18":"2Peter 1", "06_19":"2Peter 2", "06_20":"2Peter 3",
        "06_21":"1John 1", "06_22":"1John 2", "06_23":"1John 3", "06_24":"1John 4",
        "06_25":"1John 5", "06_26":"2John 1", "06_27":"3John 1", "06_28":"Jude 1",
        "06_29":"Revelation 1", "06_30":"Revelation 2",
        
        // 7 월
        "07_01":"Revelation 3", "07_02":"Revelation 4", "07_03":"Revelation 5", "07_04":"Revelation 6",
        "07_05":"Revelation 7", "07_06":"Revelation 8", "07_07":"Revelation 9", "07_08":"Revelation 10",
        "07_09":"Revelation 11", "07_10":"Revelation 12", "07_11":"Revelation 13", "07_12":"Revelation 14",
        "07_13":"Revelation 15", "07_14":"Revelation 16", "07_15":"Revelation 17", "07_16":"Revelation 18",
        "07_17":"Revelation 19", "07_18":"Revelation 20", "07_19":"Revelation 21", "07_20":"Revelation 22",
        "07_21":"Matthew 1", "07_22":"Matthew 2", "07_23":"Matthew 3", "07_24":"Matthew 4",
        "07_25":"Matthew 5", "07_26":"Matthew 6", "07_27":"Matthew 7", "07_28":"Matthew 8",
        "07_29":"Matthew 9", "07_30":"Matthew 10", "07_31":"Matthew 11",
        
        // 8 월
        "08_01":"Matthew 12", "08_02":"Matthew 13", "08_03":"Matthew 14", "08_04":"Matthew 15",
        "08_05":"Matthew 16", "08_06":"Matthew 17", "08_07":"Matthew 18", "08_08":"Matthew 19",
        "08_09":"Matthew 20", "08_10":"Matthew 21", "08_11":"Matthew 22", "08_12":"Matthew 23",
        "08_13":"Matthew 24", "08_14":"Matthew 25", "08_15":"Matthew 26", "08_16":"Matthew 27",
        "08_17":"Matthew 28", "08_18":"Mark 1", "08_19":"Mark 2", "08_20":"Mark 3",
        "08_21":"Mark 4", "08_22":"Mark 5", "08_23":"Mark 6", "08_24":"Mark 7",
        "08_25":"Mark 8", "08_26":"Mark 9", "08_27":"Mark 10", "08_28":"Mark 11",
        "08_29":"Mark 12", "08_30":"Mark 13", "08_31":"Mark 14",
        
        // 9 월
        "09_01":"Mark 15", "09_02":"Mark 16", "09_03":"Luke 1", "09_04":"Luke 2",
        "09_05":"Luke 3", "09_06":"Luke 4", "09_07":"Luke 5", "09_08":"Luke 6",
        "09_09":"Luke 7", "09_10":"Luke 8", "09_11":"Luke 9", "09_12":"Luke 10",
        "09_13":"Luke 11", "09_14":"Luke 12", "09_15":"Luke 13", "09_16":"Luke 14",
        "09_17":"Luke 15", "09_18":"Luke 16", "09_19":"Luke 17", "09_20":"Luke 18",
        "09_21":"Luke 19", "09_22":"Luke 20", "09_23":"Luke 21", "09_24":"Luke 22",
        "09_25":"Luke 23", "09_26":"Luke 24", "09_27":"John 1", "09_28":"John 2",
        "09_29":"John 3", "09_30":"John 4",
        
        // 10 월
        "10_01":"John 5", "10_02":"John 6", "10_03":"John 7", "10_04":"John 8",
        "10_05":"John 9", "10_06":"John 10", "10_07":"John 11", "10_08":"John 12",
        "10_09":"John 13", "10_10":"John 14", "10_11":"John 15", "10_12":"John 16",
        "10_13":"John 17", "10_14":"John 18", "10_15":"John 19", "10_16":"John 20",
        "10_17":"John 21", "10_18":"Genesis 1", "10_19":"Genesis 2", "10_20":"Genesis 3",
        "10_21":"Genesis 4", "10_22":"Genesis 5", "10_23":"Genesis 6", "10_24":"Genesis 7",
        "10_25":"Genesis 8", "10_26":"Genesis 9", "10_27":"Genesis 10", "10_28":"Genesis 11",
        "10_29":"Genesis 12", "10_30":"Genesis 13", "10_31":"Genesis 14",
        
        // 11 월
        "11_01":"Genesis 15", "11_02":"Genesis 16", "11_03":"Genesis 17", "11_04":"Genesis 18",
        "11_05":"Genesis 19", "11_06":"Genesis 20", "11_07":"Genesis 21", "11_08":"Genesis 22",
        "11_09":"Genesis 23", "11_10":"Genesis 24", "11_11":"Genesis 25", "11_12":"Genesis 26",
        "11_13":"Genesis 27", "11_14":"Genesis 28", "11_15":"Genesis 29", "11_16":"Genesis 30",
        "11_17":"Genesis 31", "11_18":"Genesis 32", "11_19":"Genesis 33", "11_20":"Genesis 34",
        "11_21":"Genesis 35", "11_22":"Genesis 36", "11_23":"Genesis 37", "11_24":"Genesis 38",
        "11_25":"Genesis 39", "11_26":"Genesis 40", "11_27":"Genesis 41", "11_28":"Genesis 42",
        "11_29":"Genesis 43", "11_30":"Genesis 44",
        
        // 12 월
        "12_01": "Genesis 45", "12_02": "Genesis 46", "12_03": "Genesis 47", "12_04": "Genesis 48",
        "12_05": "Genesis 49", "12_06": "Genesis 50", "12_07": "Exodus 1", "12_08": "Exodus 2",
        "12_09": "Exodus 3", "12_10": "Exodus 4", "12_11": "Exodus 5", "12_12": "Exodus 6",
        "12_13": "Exodus 7", "12_14": "Exodus 8", "12_15": "Exodus 9", "12_16": "Exodus 10",
        "12_17": "Exodus 11", "12_18": "Exodus 12", "12_19": "Exodus 13", "12_20": "Exodus 14",
        "12_21": "Exodus 15", "12_22": "Exodus 16", "12_23": "Exodus 17", "12_24": "Exodus 18",
        "12_25": "Exodus 19", "12_26": "Exodus 20", "12_27": "Exodus 21", "12_28": "Exodus 22",
        "12_29": "Exodus 23", "12_30": "Exodus 24", "12_31": "Exodus 25"
    ]
    
    @IBAction func segmentedControl(_ sender: UISegmentedControl) {
        switch segmentedToggle.selectedSegmentIndex {
        case 0:
            savingKor.isHidden = false
            savingEng.isHidden = true
            textViewQT.isHidden = true
            let date = Date()
            let formatter = DateFormatter()
            formatter.dateFormat = "MM_dd"
            let result = formatter.string(from: date)
            savingTextField.text = savingSchedule_kor[result]
        case 1:
            savingKor.isHidden = true
            savingEng.isHidden = true
            textViewQT.isHidden = false
            let date = Date()
            let formatter = DateFormatter()
            formatter.dateFormat = "MM_dd"
            let result = formatter.string(from: date)
            savingTextField.text = savingSchedule_kor[result]
        case 2:
            savingKor.isHidden = true
            savingEng.isHidden = false
            textViewQT.isHidden = true
            let date = Date()
            let formatter = DateFormatter()
            formatter.dateFormat = "MM_dd"
            let result = formatter.string(from: date)
            savingTextField.text = savingSchedule_eng[result]
            
        default:
            break
        }
    }
    
    override func viewDidLoad() {
        super.viewDidLoad()
        let date = Date()
        let formatter = DateFormatter()
        formatter.dateFormat = "MM_dd"
        let result = formatter.string(from: date)
        savingTextField.textAlignment = .center;
        savingTextField.text = savingSchedule_kor[result]
        
        formatter.dateFormat = "MM_dd_yyyy"
        let result_year = formatter.string(from: date)
        textViewQT.isEditable = false
        
        let reference = Storage.storage().reference().child(result_year + "_saving.txt")
        reference.downloadURL { (URL, error) -> Void in
            if (error != nil) {
                print("Error!!!!!!!!!!!!!!!!")
            } else {
                do {
                    let contents = try String(contentsOf: URL!)
                    self.textViewQT.text = contents
                } catch {
                    
                }
                
            }
        }
        
    }
    
    var dateFormatter: DateFormatter = {
        let formatter = DateFormatter()
        formatter.dateFormat = "yyyy/MM/dd"
        return formatter
    }()

    @IBAction func record(_ sender: UIButton){
        let date = Date()
        let uuid = getID().getUUID()
        let temp = dateFormatter.string(from:date)
        Database.database().reference().child("track").child(uuid!).child(temp).setValue(true)//        defaults.set(check, forKey:"saveDate")
        
        let alert = UIAlertController(title: "기록 완료", message: "저장되었습니다!", preferredStyle: .alert)
        alert.addAction(UIAlertAction(title: "Okay", style: .default, handler: nil))

        self.present(alert, animated: true)
    }
    
    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }
}
