//
//  sendingpage.swift
//  newsongtime
//
//  Created by Cherish Park on 12/26/19.
//  Copyright © 2019 Newsong church. All rights reserved.
//

import UIKit

class sendingpage: UIViewController{
    @IBOutlet weak var sendingpageToggle: UISegmentedControl!
    @IBOutlet weak var sendingTextField: UITextField!
    @IBOutlet weak var sendingeng: UIView!
    @IBOutlet weak var sendingkor: UIView!
    

    
    var sendingSchedule_kor = [
            // 2019 년
            // 1 월
            "01_01":"마태복음 1-3, 시편 1-2장","01_02":"마태복음 4-6장, 시편 3-4장","01_03":"마태복음 7-9장, 시편 5-6장","01_04":"마태복음 10-11장, 시편 7-9장",
            "01_05":"마태복음 12-13장, 시편 14-16장","01_06":"마태복음 14-16장, 시편 17-18장","01_07":"마태복음 17-19장, 시편 19-20장","01_08":"마태복음 20-22장, 시편 21-22장",
            "01_09":"마태복음 23-24장, 시편 23-25장","01_10":"마태복음 25-26장, 시편 26-28장","01_11":"마태복음 27-28장, 시편 29-31장","01_12":"마가복음 1-2장, 시편 32-34장",
            "01_13":"마가복음 3-4장, 시편 35-37장","01_14":"마가복음 5-6장, 시편 38-40장","01_15":"마가복음 7-8장, 시편 41-43장","01_16":"마가복음 9-10장, 시편 44-46장",
            "01_17":"마가복음 11-12장, 시편 47-49장","01_18":"마가복음 13-14장, 시편 50-52장","01_19":"마가복음 15-16장, 시편 53-55장","01_20":"누가복음 1-2장, 시편 56-58장",
            "01_21":"누가복음 3-4장, 시편 59-61장","01_22":"누가복음 5-6장, 시편 62-64장","01_23":"누가복음 7-8장, 시편 65-67장","01_24":"누가복음 9-10장, 시편 68-70장",
            "01_25":"누가복음 11-12장, 시편 71-73장","01_26":"누가복음 13-14장, 시편 74-76장","01_27":"누가복음 15-16장, 시편 77-79장","01_28":"누가복음 17-18장, 시편 80-82장",
            "01_29":"누가복음 19-20장, 시편 83-85장","01_30":"누가복음 21-22장, 시편 86-88장","01_31":"누가복음 23-24장, 시편 89-90장",

            // 2 월
            "02_01":"요한복음 1-3장, 시편 91-92장","02_02":"요한복음 4-6장, 시편 93-94장","02_03":"요한복음 7-8장, 시편 95-97장",
            "02_04":"요한복음 9-11장, 시편 98-100장","02_05":"요한복음 12-13장, 시편 101-103장","02_06":"요한복음 14-16장, 시편 104-106장",
            "02_07":"요한복음 17-18장, 시편 107-108장","02_08":"요한복음 19-21장, 시편 109-110장","02_09":"사도행전 1-3장, 시편 111-112장",
            "02_10":"사도행전 4-6장, 시편 113-114장","02_11":"사도행전 7-9장, 시편 115-116장","02_12":"사도행전 10-11장, 시편 117-119장",
            "02_13":"사도행전 12-14장, 시편 120-121장","02_14":"사도행전 15-17장, 시편 122-123장","02_15":"사도행전 18-20장, 시편 124-125장",
            "02_16":"사도행전 21-22장, 시편 126-128장","02_17":"사도행전 23-25장, 시편 129-130장","02_18":"사도행전 26-28장, 시편 131-132장",
            "02_19":"로마서 1-3장, 시편 133-134장","02_20":"로마서 4-7장, 시편 135장","02_21":"로마서 8-10장, 시편 136-137장",
            "02_22":"로마서 11-13장, 시편 138-139장","02_23":"로마서 14-16장, 시편 140-141장","02_24":"고린도전서 1-4장, 시편 142장",
            "02_25":"고린도전서 5-7장, 시편 143-144장","02_26":"고린도전서 8-11장, 시편 145장","02_27":"고린도전서 12-14장, 시편 146-147장",
            "02_28":"고린도전서 15-16장, 시편 148-150장","02_29":"고린도후서 1-3장, 잠언 1-2장",

            // 3 월
            "03_01":"고린도후서 4-5장, 잠언 3-5장","03_02":"고린도후서 6-8장, 잠언 6-7장","03_03":"고린도후서 9-11장, 잠언 8-9장","03_04":"고린도후서 12-13장, 잠언 10-12장",
            "03_05":"갈라디아서 1-3장, 잠언 13-14장","03_06":"갈라디아서 4-6장, 잠언 15-16장","03_07":"에베소서 1-3장, 잠언 17장","03_08":"에베소서 4-6장, 잠언 18-19장",
            "03_09":"빌립보서 1-4장, 잠언 20장","03_10":"골로새서 1-4장, 잠언 21장","03_11":"데살로니가전서 1-5장","03_12":"데살로니가후서 1-3장, 잠언 22-23장",
            "03_13":"디모데전서 1-3장, 잠언 24-25장","03_14":"디모데전서 4-6장, 잠언 26-27장","03_15":"디모데후서 1-4장, 잠언 28장","03_16":"디도서 1장 - 빌레몬서 1장, 잠언 29-31장",
            "03_17":"히브리서 1-4장, 시편 1장","03_18":"히브리서 5-9장","03_19":"히브리서 10-13장, 시편 2-3장","03_20":"야고보서 1-5장",
            "03_21":"베드로전서 1-5장","03_22":"베드로후서 1-3장, 시편 4-5장","03_23":"요한일서 1-5장","03_24":"요한이서 8장 - 유다서 1장, 시편 6-7장",
            "03_25":"요한계시록 1-3장, 시편 8-9장","03_26":"요한계시록 4-6장, 시편 10-11장","03_27":"요한계시록 7-9장, 시편 12-13장","03_28":"요한계시록 10-12장, 시편 14-15장",
            "03_29":"요한계시록 13-15장, 시편 16-17장","03_30":"요한계시록 16-19장, 시편 18장","03_31":"요한계시록 20-22장, 시편 19-20장",

            // 4 월
            "04_01":"창세기 1-3장, 시편 21-22장","04_02":"창세기 4-7장, 시편 23장","04_03":"창세기 8-11장, 시편 24장","04_04":"창세기 12-16장, 시편 25장",
            "04_05":"창세기 17-19장, 시편 26-27장","04_06":"창세기 20-22장, 시편 28-29장","04_07":"창세기 23-24장, 시편 30-32장","04_08":"창세기 25-26장, 시편 33-35장",
            "04_09":"창세기 27-29장, 시편 36-37장","04_10":"창세기 30-31장, 시편 38-40장","04_11":"창세기 32-34장, 시편 41-42장","04_12":"창세기 35-37장, 시편 43-44장",
            "04_13":"창세기 38-40장, 시편 45-46장","04_14":"창세기 41-42장, 시편 47-49장","04_15":"창세기 43-44장, 시편 50-52장","04_16":"창세기 45-57장, 시편 54-53장",
            "04_17":"창세기 48-50장, 시편 55-56장","04_18":"출애굽기 1-4장, 시편 57장","04_19":"출애굽기 5-7장, 시편 58-59장","04_20":"출애굽기 8-9장, 시편 60-62장",
            "04_21":"출애굽기 10-12장, 시편 63-64장","04_22":"출애굽기 13-15장, 시편 65-66장","04_23":"출애굽기 16-18장, 시편 67-68장","04_24":"출애굽기 19-21장, 시편 69-70장",
            "04_25":"출애굽기 22-25장, 시편 71장","04_26":"출애굽기 26-28장, 시편 72-74장","04_27":"출애굽기 29-30장, 시편 75-77장","04_28":"출애굽기 31-33장, 시편 78-79장",
            "04_29":"출애굽기 34-36장, 시편 80-81장","04_30":"출애굽기 37-40장, 시편 82장",

            // 5 월
            "05_01":"레위기 1-4장, 시편 83장","05_02":"레위기 5-7장, 시편 84-85장","05_03":"레위기 8-10장, 시편 86-87장","05_04":"레위기 11-13장, 시편 88-89장",
            "05_05":"레위기 14-15장, 시편 90-92장","05_06":"레위기 16-18장, 시편 93-94장","05_07":"레위기 19-21장, 시편 95-96장","05_08":"레위기 22-23장, 시편 97-99장",
            "05_09":"레위기 24-25장, 시편 100-102장","05_10":"레위기 26-27장, 시편 103-105장","05_11":"민수기 1-3장, 시편 106-107장","05_12":"민수기 4-5장, 시편 108-109장",
            "05_13":"민수기 6-7장, 시편 110-112장","05_14":"민수기 8-10장, 시편 113-114장","05_15":"민수기 11-13장, 시편 115-116장","05_16":"민수기 14-15장, 시편 117-118장",
            "05_17":"민수기 16-18장, 시편 119-120장","05_18":"민수기 19-21장, 시편 121-122장","05_19":"민수기 22-23장, 시편 123-125장","05_20":"민수기 24-26장, 시편 126-127장",
            "05_21":"민수기 27-29장, 시편 128-129장","05_22":"민수기 30-32장, 시편 130-131장","05_23":"민수기 33-36장, 시편 132장","05_24":"신명기 1-3장, 시편 133-134장",
            "05_25":"신명기 4-6장, 시편 135-136장","05_26":"신명기 7-9장, 시편 137-138장","05_27":"신명기 10-12장, 시편 139-140장","05_28":"신명기 13-15장, 시편 141-142장",
            "05_29":"신명기 16-18장, 시편 143-144장","05_30":"신명기 19-21장, 시편 145-146장","05_31":"신명기 22-24장, 시편 147-148장",

            // 6 월
            "06_01":"신명기 25-27장, 시편 149-150장","06_02":"신명기 28장, 잠언 1-4장","06_03":"신명기 29-31장, 잠언 5-6장","06_04":"신명기 32-34장, 잠언 7-8장",
            "06_05":"여호수아 1-3장, 잠언 9-10장","06_06":"여호수아 4-6장, 잠언 11-12장","06_07":"여호수아 7-8장, 잠언 13-15장","06_08":"여호수아 9-10장, 잠언 16-18장",
            "06_09":"여호수아 11-13장, 잠언 19-21장","06_10":"여호수아 14-17장, 잠언 22장","06_11":"여호수아 18-20장, 잠언 23-24장","06_12":"여호수아 21-22장, 잠언 25-27장",
            "06_13":"여호수아 23-24장, 잠언 28-30장","06_14":"사사기 1-3장, 잠언 31장","06_15":"사사기 4-5장, 시편 1-3장","06_16":"사사기 6-7장, 시편 4-6장",
            "06_17":"사사기 8-9장, 시편 7-9장","06_18":"사사기 10-12장, 시편 10-12장","06_19":"사사기 13-15장, 시편 13-14장","06_20":"사사기 16-18장, 시편 15-16장",
            "06_21":"사사기 19-21장, 시편 17-18장","06_22":"룻기 1-2장, 시편 19-21장","06_23":"룻기 3-4장, 시편 22-24장","06_24":"사무엘상 1-3장, 시편 25-26장",
            "06_25":"사무엘상 4-6장, 시편 27-28장","06_26":"사무엘상 7-9장, 시편 29-30장","06_27":"사무엘상 10-12장, 시편 31-32장","06_28":"사무엘상 13-15장, 시편 33-34장",
            "06_29":"사무엘상 16-17장, 시편 35-36장","06_30":"사무엘상 18-19장, 시편 37-38장",

            // 7 월자
            "07_01":"사무엘상 20-22장, 시편 39-40장","07_02":"사무엘상 23-25장, 시편 41-42장","07_03":"사무엘상 26-28장, 시편 43-44장","07_04":"사무엘상 29-31장, 시편 45-46장",
            "07_05":"사무엘하 1-3장, 시편 47-48장","07_06":"사무엘하 4-6장, 시편 49-50장","07_07":"사무엘하 7-9장, 시편 51-52장","07_08":"사무엘하 10-12장, 시편 53-54장",
            "07_09":"사무엘하 13-14장, 시편 55-57장","07_10":"사무엘하 15-16장, 시편 58-60장","07_11":"사무엘하 17-18장, 시편 61-63장","07_12":"사무엘하 19-20장, 시편 64-65장",
            "07_13":"사무엘하 21-22장, 시편 66-67장","07_14":"사무엘하 23-24장, 시편 68-70장","07_15":"열왕기상 1-2장, 시편 71-73장","07_16":"열왕기상 3-4장, 시편 74-76장",
            "07_17":"열왕기상 5-6장, 시편 77-79장","07_18":"열왕기상 7장, 시편 80-84장","07_19":"열왕기상 8장, 시편 85-88장","07_20":"열왕기상 9-11장, 시편 89-91장",
            "07_21":"열왕기상 12-13장, 시편 92-94장","07_22":"열왕기상 14-16장, 시편 95-96장","07_23":"열왕기상 17-18장, 시편 97-99장","07_24":"열왕기상 19-20장, 시편 100-102장",
            "07_25":"열왕기상 21-22장, 시편 103-105장","07_26":"열왕기하 1-3장, 시편 106-107장","07_27":"열왕기하 4-5장, 시편 108-109장","07_28":"열왕기하 6-8장, 시편 110-111장",
            "07_29":"열왕기하 9-11장, 시편 112-113장","07_30":"열왕기하 12-14장, 시편 114-115장","07_31":"열왕기하 15-17장, 시편 116-117장",

            // 8 월
            "08_01":"열왕기하 18-20장, 시편 118-119장","08_02":"열왕기하 21-22장, 시편 120-122장","08_03":"열왕기하 23-25장, 시편 123-124장","08_04":"역대상 1-3장, 시편 125-126장",
            "08_05":"역대상 4-6장, 시편 127-128장","08_06":"역대상 7-10장, 시편 129장","08_07":"역대상 11-12장, 시편 130-132장","08_08":"역대상 13-16장, 시편 133장",
            "08_09":"역대상 17-20장, 시편 134장","08_10":"역대상 21-23장, 시편 135-136장","08_11":"역대상 24-26장, 시편 137-138장","08_12":"역대상 27-29장, 시편 139-140장",
            "08_13":"역대하 1-4장, 시편 141장","08_14":"역대하 5-6장, 시편 142-144장","08_15":"역대하 7-9장, 시편 145-147장","08_16":"역대하 10-13장, 시편 148장",
            "08_17":"역대하 14-17장, 시편 149장","08_18":"역대하 18-20장, 시편 150장","08_19":"역대하 21-23장, 잠언 1-2장","08_20":"역대하 24-26장, 잠언 3-4장",
            "08_21":"역대하 27-29장, 잠언 5-6장","08_22":"역대하 30-32장, 잠언 7-8장","08_23":"역대하 33-34장, 잠언 9-11장","08_24":"역대하 35-36장, 잠언 12-14장",
            "08_25":"에스라 1-4장, 잠언 15장","08_26":"에스라 5-7장, 잠언 16-17장","08_27":"에스라 8-10장, 잠언 18-19장","08_28":"느헤미야 1-2장, 잠언 20-22장",
            "08_29":"느헤미야 3-5장, 잠언 23-24장","08_30":"느헤미야 6-7장, 잠언 25-27장","08_31":"느헤미야 8-9장, 잠언 28-30장",

            // 9 월
            "09_01":"느헤미야 10-11장, 잠언 31장, 시편 1-2장","09_02":"느헤미야 12-13장, 시편 3-5장","09_03":"에스더 1-5장","09_04":"에스더 6-10장",
            "09_05":"욥기 1-4장, 시편 6장","09_06":"욥기 5-9장","09_07":"욥기 10-14장","09_08":"욥기 15-19장",
            "09_09":"욥기 20-24장","09_10":"욥기 25-30장","09_11":"욥기 31-34장, 시편 7장","09_12":"욥기 35-38장, 시편 8장",
            "09_13":"욥기 39-42장, 시편 9장","09_14":"시편 1-10장","09_15":"시편 11-18장","09_16":"시편 19-25장",
            "09_17":"시편 26-32장","09_18":"시편 33-37장","09_19":"시편 38-44장","09_20":"시편 45-51장",
            "09_21":"시편 52-59장","09_22":"시편 60-67장","09_23":"시편 68-71장","09_24":"시편 72-77장",
            "09_25":"시편 78-81장","09_26":"시편 82-88장","09_27":"시편 89-94장","09_28":"시편 95-102장",
            "09_29":"시편 103-105장","09_30":"시편 106-109장",

            // 10 월
            "10_01":"시편 110-118장","10_02":"시편 119장","10_03":"시편 120-134장","10_04":"시편 135-140장",
            "10_05":"시편 141-150장","10_06":"잠언 1-5장","10_07":"잠언 6-10장","10_08":"잠언 11-15장",
            "10_09":"잠언 16-19장","10_10":"잠언 20-23장","10_11":"잠언 24-27장","10_12":"잠언 28-31장",
            "10_13":"전도서 1-6장","10_14":"전도서 7-12장","10_15":"아가 1-8장","10_16":"이사야 1-3장, 시편 10-11장",
            "10_17":"이사야 4-6장, 시편 12-13장","10_18":"이사야 7-9장, 시편 14-15장","10_19":"이사야 10-13장, 시편 16장","10_20":"이사야 14-17장, 시편 17장",
            "10_21":"이사야 18-22장","10_22":"이사야 23-27장","10_23":"이사야 28-29장, 시편 18-20장","10_24":"이사야 30-32장, 시편 21-22장",
            "10_25":"이사야 33-36장, 시편 23장","10_26":"이사야 37-39장, 시편 24-25장","10_27":"이사야 40-41장, 시편 26-28장","10_28":"이사야 42-44장, 시편 29-30장",
            "10_29":"이사야 45-48장, 시편 31장","10_30":"이사야 49-51장, 시편 32-33장","10_31":"이사야 52-55장, 시편 34장",

            // 11 월
            "11_01":"이사야 56-59장, 시편 35장","11_02":"이사야 60-63장, 시편 36장","11_03":"이사야 64-66장, 시편 37-39장","11_04":"예레미야 1-3장, 시편 39-40장",
            "11_05":"예레미야 4-6장, 시편 41-42장","11_06":"예레미야 7-9장, 시편 43-44장","11_07":"예레미야 10-13장, 시편 45장","11_08":"예레미야 14-16장, 시편 46-47장",
            "11_09":"예레미야 17-20장, 시편 48장","11_10":"예레미야 21-23장, 시편 49-50장","11_11":"예레미야 24-26장, 시편 51-52장","11_12":"예레미야 27-29장, 시편 53-54장",
            "11_13":"예레미야 30-31장, 시편 55-57장","11_14":"예레미야 32-33장, 시편 58-59장","11_15":"예레미야 34-36장, 시편 60-61장","11_16":"예레미야 37-39장, 시편 62-63장",
            "11_17":"예레미야 40-42장, 시편 64-65장","11_18":"예레미야 43-45장, 시편 66-67장","11_19":"예레미야 46-48장, 시편 68-69장","11_20":"예레미야 49-50장, 시편 70-71장",
            "11_21":"예레미야 51-52장, 시편 72-74장","11_22":"예레미야애가 1-2장, 시편 75-77장","11_23":"예레미야애가 3-5장, 시편 78-79장","11_24":"에스겔 1-4장, 시편 80장",
            "11_25":"에스겔 5-7장, 시편 81-82장","11_26":"에스겔 8-11장, 시편 83장","11_27":"에스겔 12-14장, 시편 84-85장","11_28":"에스겔 15-17장, 시편 86-87장",
            "11_29":"에스겔 18-19장, 시편 88-90장","11_30":"에스겔 20-22장, 시편 91-92장",

            // 12 월
            "12_01":"에스겔 23-24장, 시편 93-94장","12_02":"에스겔 25-27장, 시편 95-96장","12_03":"에스겔 28-30장, 시편 97-98장","12_04":"에스겔 31-32장, 시편 99-101장",
            "12_05":"에스겔 33-35장, 시편 102-103장","12_06":"에스겔 36-38장, 시편 104-105장","12_07":"에스겔 39-40장, 시편 106-108장","12_08":"에스겔 41-43장, 시편 109-110장",
            "12_09":"에스겔 44-45장, 시편 111-113장","12_10":"에스겔 46-48장, 시편 114-115장","12_11":"다니엘 1-2장, 시편 116-118장","12_12":"다니엘 3-4장, 시편 119-121장",
            "12_13":"다니엘 5-6장, 시편 122-124장","12_14":"다니엘 7-9장, 시편 125-126장","12_15":"다니엘 10-12장, 시편 127-128장","12_16":"호세아 1-4장",
            "12_17":"호세아 5-9장","12_18":"호세아 10-14장","12_19":"요엘 1-3장, 시편 129-130장","12_20":"아모스 1-5장",
            "12_21":"아모스 6-9장, 시편 131장","12_22":"오바댜 1장 - 요나 4장","12_23":"미가 1-7장","12_24":"나훔 1-3장, 시편 132-133장",
            "12_25":"하박국 1-3장, 시편 134-135장","12_26":"스바냐 1-3장, 시편 136-137장","12_27":"학개 1-2장, 시편 138-141장","12_28":"스가랴 1-5장, 시편 142-143장",
            "12_29":"스가랴 6-10장, 시편 144-145장","12_30":"스가랴 11-14장, 시편 146-147장","12_31":"말라기 1-4장, 시편 148-150장"
       ]
    
    var sendingSchedule_eng = [
         // 2019 년
         // 1 월
         "01_01":"Matthew 1-3, Psalms 1-2","01_02":"Matthew 4-6, Psalms 3-4","01_03":"Matthew 7-9, Psalms 5-6","01_04":"Matthew 10-11, Psalms 7-9",
         "01_05":"Matthew 12-13, Psalms 14-16","01_06":"Matthew 14-16, Psalms 17-18","01_07":"Matthew 17-19, Psalms 19-20","01_08":"Matthew 20-22, Psalms 21-22",
         "01_09":"Matthew 23-24, Psalms 23-25","01_10":"Matthew 25-26, Psalms 26-28","01_11":"Matthew 27-28, Psalms 29-31","01_12":"Mark 1-2, Psalms 32-34",
         "01_13":"Mark 3-4, Psalms 35-37","01_14":"Mark 5-6, Psalms 38-40","01_15":"Mark 7-8, Psalms 41-43","01_16":"Mark 9-10, Psalms 44-46",
         "01_17":"Mark 11-12, Psalms 47-49","01_18":"Mark 13-14, Psalms 50-52","01_19":"Mark 15-16, Psalms 53-55","01_20":"Luke 1-2, Psalms 56-58",
         "01_21":"Luke 3-4, Psalms 59-61","01_22":"Luke 5-6, Psalms 62-64","01_23":"Luke 7-8, Psalms 65-67","01_24":"Luke 9-10, Psalms 68-70",
         "01_25":"Luke 11-12, Psalms 71-73","01_26":"Luke 13-14, Psalms 74-76","01_27":"Luke 15-16, Psalms 77-79","01_28":"Luke 17-18, Psalms 80-82",
         "01_29":"Luke 19-20, Psalms 83-85","01_30":"Luke 21-22, Psalms 86-88","01_31":"Luke 23-24, Psalms 89-90",

         // 2 월
         "02_01":"John 1-3, Psalms 91-92","02_02":"John 4-6, Psalms 93-94","02_03":"John 7-8, Psalms 95-97",
         "02_04":"John 9-11, Psalms 98-100","02_05":"John 12-13, Psalms 101-103","02_06":"John 14-16, Psalms 104-106",
         "02_07":"John 17-18, Psalms 107-108","02_08":"John 19-21, Psalms 109-110","02_09":"Acts 1-3, Psalms 111-112",
         "02_10":"Acts 4-6, Psalms 113-114","02_11":"Acts 7-9, Psalms 115-116","02_12":"Acts 10-11, Psalms 117-119",
         "02_13":"Acts 12-14, Psalms 120-121","02_14":"Acts 15-17, Psalms 122-123","02_15":"Acts 18-20, Psalms 124-125",
         "02_16":"Acts 21-22, Psalms 126-128","02_17":"Acts 23-25, Psalms 129-130","02_18":"Acts 26-28, Psalms 131-132",
         "02_19":"Romans 1-3, Psalms 133-134","02_20":"Romans 4-7, Psalms 135","02_21":"Romans 8-10, Psalms 136-137",
         "02_22":"Romans 11-13, Psalms 138-139","02_23":"Romans 14-16, Psalms 140-141","02_24":"1Corinthians 1-4, Psalms 142",
         "02_25":"1Corinthians 5-7, Psalms 143-144","02_26":"1Corinthians 8-11, Psalms 145","02_27":"1Corinthians 12-14, Psalms 146-147",
         "02_28":"1Corinthians 15-16, Psalms 148-150","02_29":"2Corinthians 1-3, Proverbs 1-2",

         // 3 월
         "03_01":"2Corinthians  4-5, Proverbs 3-5","03_02":"2Corinthians  6-8, Proverbs 6-7","03_03":"2Corinthians  9-11, Proverbs 8-9","03_04":"2Corinthians  12-13, Proverbs 10-12",
         "03_05":"Galatians 1-3, Proverbs 13-14","03_06":"Galatians 4-6, Proverbs 15-16","03_07":"Ephesians 1-3, Proverbs 17","03_08":"Ephesians 4-6, Proverbs 18-19",
         "03_09":"Philippians 1-4, Proverbs 20","03_10":"Colossians 1-4, Proverbs 21","03_11":"1Thessalonians 1-5","03_12":"2Thessalonians 1-3, Proverbs 22-23",
         "03_13":"1Timothy 1-3, Proverbs 24-25","03_14":"1Timothy 4-6, Proverbs 26-27","03_15":"2Timothy 1-4, Proverbs 28","03_16":"Titus 1 - Philemon 1, Proverbs 29-31",
         "03_17":"Hebrews 1-4, Psalms 1","03_18":"Hebrews 5-9","03_19":"Hebrews 10-13, Psalms 2-3","03_20":"James 1-5",
         "03_21":"1Peter 1-5","03_22":"2Peter 1-3, Psalms 4-5","03_23":"1John 1-5","03_24":"2John 8 - Jude 1, Psalms 6-7",
         "03_25":"Revelation 1-3, Psalms 8-9","03_26":"Revelation 4-6, Psalms 10-11","03_27":"Revelation 7-9, Psalms 12-13","03_28":"Revelation 10-12, Psalms 14-15",
         "03_29":"Revelation 13-15, Psalms 16-17","03_30":"Revelation 16-19, Psalms 18","03_31":"Revelation 20-22, Psalms 19-20",

         // 4 월
         "04_01":"Genesis 1-3, Psalms 21-22","04_02":"Genesis 4-7, Psalms 23","04_03":"Genesis 8-11, Psalms 24","04_04":"Genesis 12-16, Psalms 25",
         "04_05":"Genesis 17-19, Psalms 26-27","04_06":"Genesis 20-22, Psalms 28-29","04_07":"Genesis 23-24, Psalms 30-32","04_08":"Genesis 25-26, Psalms 33-35",
         "04_09":"Genesis 27-29, Psalms 36-37","04_10":"Genesis 30-31, Psalms 38-40","04_11":"Genesis 32-34, Psalms 41-42","04_12":"Genesis 35-37, Psalms 43-44",
         "04_13":"Genesis 38-40, Psalms 45-46","04_14":"Genesis 41-42, Psalms 47-49","04_15":"Genesis 43-44, Psalms 50-52","04_16":"Genesis 45-57, Psalms 54-53",
         "04_17":"Genesis 48-50, Psalms 55-56","04_18":"Exodus 1-4, Psalms 57","04_19":"Exodus 5-7, Psalms 58-59","04_20":"Exodus 8-9, Psalms 60-62",
         "04_21":"Exodus 10-12, Psalms 63-64","04_22":"Exodus 13-15, Psalms 65-66","04_23":"Exodus 16-18, Psalms 67-68","04_24":"Exodus 19-21, Psalms 69-70",
         "04_25":"Exodus 22-25, Psalms 71","04_26":"Exodus 26-28, Psalms 72-74","04_27":"Exodus 29-30, Psalms 75-77","04_28":"Exodus 31-33, Psalms 78-79",
         "04_29":"Exodus 34-36, Psalms 80-81","04_30":"Exodus 37-40, Psalms 82",

         // 5 월
         "05_01":"Leviticus 1-4, Psalms 83","05_02":"Leviticus 5-7, Psalms 84-85","05_03":"Leviticus 8-10, Psalms 86-87","05_04":"Leviticus 11-13, Psalms 88-89",
         "05_05":"Leviticus 14-15, Psalms 90-92","05_06":"Leviticus 16-18, Psalms 93-94","05_07":"Leviticus 19-21, Psalms 95-96","05_08":"Leviticus 22-23, Psalms 97-99",
         "05_09":"Leviticus 24-25, Psalms 100-102","05_10":"Leviticus 26-27, Psalms 103-105","05_11":"Numbers 1-3, Psalms 106-107","05_12":"Numbers 4-5, Psalms 108-109",
         "05_13":"Numbers 6-7, Psalms 110-112","05_14":"Numbers 8-10, Psalms 113-114","05_15":"Numbers 11-13, Psalms 115-116","05_16":"Numbers 14-15, Psalms 117-118",
         "05_17":"Numbers 16-18, Psalms 119-120","05_18":"Numbers 19-21, Psalms 121-122","05_19":"Numbers 22-23, Psalms 123-125","05_20":"Numbers 24-26, Psalms 126-127",
         "05_21":"Numbers 27-29, Psalms 128-129","05_22":"Numbers 30-32, Psalms 130-131","05_23":"Numbers 33-36, Psalms 132","05_24":"Deuteronomy 1-3, Psalms 133-134",
         "05_25":"Deuteronomy 4-6, Psalms 135-136","05_26":"Deuteronomy 7-9, Psalms 137-138","05_27":"Deuteronomy 10-12, Psalms 139-140","05_28":"Deuteronomy 13-15, Psalms 141-142",
         "05_29":"Deuteronomy 16-18, Psalms 143-144","05_30":"Deuteronomy 19-21, Psalms 145-146","05_31":"Deuteronomy 22-24, Psalms 147-148",

         // 6 월
         "06_01":"Deuteronomy 25-27, Psalms 149-150","06_02":"Deuteronomy 28, Proverbs 1-4","06_03":"Deuteronomy 29-31, Proverbs 5-6","06_04":"Deuteronomy 32-34, Proverbs 7-8",
         "06_05":"Joshua 1-3, Proverbs 9-10","06_06":"Joshua 4-6, Proverbs 11-12","06_07":"Joshua 7-8, Proverbs 13-15","06_08":"Joshua 9-10, Proverbs 16-18",
         "06_09":"Joshua 11-13, Proverbs 19-21","06_10":"Joshua 14-17, Proverbs 22","06_11":"Joshua 18-20, Proverbs 23-24","06_12":"Joshua 21-22, Proverbs 25-27",
         "06_13":"Joshua 23-24, Proverbs 28-30","06_14":"Judges 1-3, Proverbs 31","06_15":"Judges 4-5, Psalms 1-3","06_16":"Judges 6-7, Psalms 4-6",
         "06_17":"Judges 8-9, Psalms 7-9","06_18":"Judges 10-12, Psalms 10-12","06_19":"Judges 13-15, Psalms 13-14","06_20":"Judges 16-18, Psalms 15-16",
         "06_21":"Judges 19-21, Psalms 17-18","06_22":"Ruth 1-2, Psalms 19-21","06_23":"Ruth 3-4, Psalms 22-24","06_24":"1Samuel 1-3, Psalms 25-26",
         "06_25":"1Samuel 4-6, Psalms 27-28","06_26":"1Samuel 7-9, Psalms 29-30","06_27":"1Samuel 10-12, Psalms 31-32","06_28":"1Samuel 13-15, Psalms 33-34",
         "06_29":"1Samuel 16-17, Psalms 35-36","06_30":"1Samuel 18-19, Psalms 37-38",

         // 7 월자
         "07_01":"1Samuel 20-22, Psalms 39-40","07_02":"1Samuel 23-25, Psalms 41-42","07_03":"1Samuel 26-28, Psalms 43-44","07_04":"1Samuel 29-31, Psalms 45-46",
         "07_05":"2Samuel 1-3, Psalms 47-48","07_06":"2Samuel 4-6, Psalms 49-50","07_07":"2Samuel 7-9, Psalms 51-52","07_08":"2Samuel 10-12, Psalms 53-54",
         "07_09":"2Samuel 13-14, Psalms 55-57","07_10":"2Samuel 15-16, Psalms 58-60","07_11":"2Samuel 17-18, Psalms 61-63","07_12":"2Samuel 19-20, Psalms 64-65",
         "07_13":"2Samuel 21-22, Psalms 66-67","07_14":"2Samuel 23-24, Psalms 68-70","07_15":"1Kings 1-2, Psalms 71-73","07_16":"1Kings 3-4, Psalms 74-76",
         "07_17":"1Kings 5-6, Psalms 77-79","07_18":"1Kings 7, Psalms 80-84","07_19":"1Kings 8, Psalms 85-88","07_20":"1Kings 9-11, Psalms 89-91",
         "07_21":"1Kings 12-13, Psalms 92-94","07_22":"1Kings 14-16, Psalms 95-96","07_23":"1Kings 17-18, Psalms 97-99","07_24":"1Kings 19-20, Psalms 100-102",
         "07_25":"1Kings 21-22, Psalms 103-105","07_26":"2Kings 1-3, Psalms 106-107","07_27":"2Kings 4-5, Psalms 108-109","07_28":"2Kings 6-8, Psalms 110-111",
         "07_29":"2Kings 9-11, Psalms 112-113","07_30":"2Kings 12-14, Psalms 114-115","07_31":"2Kings 15-17, Psalms 116-117",

         // 8 월
         "08_01":"2Kings 18-20, Psalms 118-119","08_02":"2Kings 21-22, Psalms 120-122","08_03":"2Kings 23-25, Psalms 123-124","08_04":"1Chronicles 1-3, Psalms 125-126",
         "08_05":"1Chronicles 4-6, Psalms 127-128","08_06":"1Chronicles 7-10, Psalms 129","08_07":"1Chronicles 11-12, Psalms 130-132","08_08":"1Chronicles 13-16, Psalms 133",
         "08_09":"1Chronicles 17-20, Psalms 134","08_10":"1Chronicles 21-23, Psalms 135-136","08_11":"1Chronicles 24-26, Psalms 137-138","08_12":"1Chronicles 27-29, Psalms 139-140",
         "08_13":"2Chronicles 1-4, Psalms 141","08_14":"2Chronicles 5-6, Psalms 142-144","08_15":"2Chronicles 7-9, Psalms 145-147","08_16":"2Chronicles 10-13, Psalms 148",
         "08_17":"2Chronicles 14-17, Psalms 149","08_18":"2Chronicles 18-20, Psalms 150","08_19":"2Chronicles 21-23, Proverbs 1-2","08_20":"2Chronicles 24-26, Proverbs 3-4",
         "08_21":"2Chronicles 27-29, Proverbs 5-6","08_22":"2Chronicles 30-32, Proverbs 7-8","08_23":"2Chronicles 33-34, Proverbs 9-11","08_24":"2Chronicles 35-36, Proverbs 12-14",
         "08_25":"Ezra 1-4, Proverbs 15","08_26":"Ezra 5-7, Proverbs 16-17","08_27":"Ezra 8-10, Proverbs 18-19","08_28":"Nehemiah 1-2, Proverbs 20-22",
         "08_29":"Nehemiah 3-5, Proverbs 23-24","08_30":"Nehemiah 6-7, Proverbs 25-27","08_31":"Nehemiah 8-9, Proverbs 28-30",

         // 9 월
         "09_01":"Nehemiah 10-11, Proverbs 31, Psalms 1-2","09_02":"Nehemiah 12-13, Psalms 3-5","09_03":"Esther 1-5","09_04":"Esther 6-10",
         "09_05":"Job 1-4, Psalms 6","09_06":"Job 5-9","09_07":"Job 10-14","09_08":"Job 15-19",
         "09_09":"Job 20-24","09_10":"Job 25-30","09_11":"Job 31-34, Psalms 7","09_12":"Job 35-38, Psalms 8",
         "09_13":"Job 39-42, Psalms 9","09_14":"Psalms 1-10","09_15":"Psalms 11-18","09_16":"Psalms 19-25",
         "09_17":"Psalms 26-32","09_18":"Psalms 33-37","09_19":"Psalms 38-44","09_20":"Psalms 45-51",
         "09_21":"Psalms 52-59","09_22":"Psalms 60-67","09_23":"Psalms 68-71","09_24":"Psalms 72-77",
         "09_25":"Psalms 78-81","09_26":"Psalms 82-88","09_27":"Psalms 89-94","09_28":"Psalms 95-102",
         "09_29":"Psalms 103-105","09_30":"Psalms 106-109",

         // 10 월
         "10_01":"Psalms 110-118","10_02":"Psalms 119","10_03":"Psalms 120-134","10_04":"Psalms 135-140",
         "10_05":"Psalms 141-150","10_06":"Proverbs 1-5","10_07":"Proverbs 6-10","10_08":"Proverbs 11-15",
         "10_09":"Proverbs 16-19","10_10":"Proverbs 20-23","10_11":"Proverbs 24-27","10_12":"Proverbs 28-31",
         "10_13":"Ecclesiastes 1-6","10_14":"Ecclesiastes 7-12","10_15":"Song of Songs 1-8","10_16":"Isaiah 1-3, Psalms 10-11",
         "10_17":"Isaiah 4-6, Psalms 12-13","10_18":"Isaiah 7-9, Psalms 14-15","10_19":"Isaiah 10-13, Psalms 16","10_20":"Isaiah 14-17, Psalms 17",
         "10_21":"Isaiah 18-22","10_22":"Isaiah 23-27","10_23":"Isaiah 28-29, Psalms 18-20","10_24":"Isaiah 30-32, Psalms 21-22",
         "10_25":"Isaiah 33-36, Psalms 23","10_26":"Isaiah 37-39, Psalms 24-25","10_27":"Isaiah 40-41, Psalms 26-28","10_28":"Isaiah 42-44, Psalms 29-30",
         "10_29":"Isaiah 45-48, Psalms 31","10_30":"Isaiah 49-51, Psalms 32-33","10_31":"Isaiah 52-55, Psalms 34",

         // 11 월
         "11_01":"Isaiah 56-59, Psalms 35","11_02":"Isaiah 60-63, Psalms 36","11_03":"Isaiah 64-66, Psalms 37-39","11_04":"Jeremiah 1-3, Psalms 39-40",
         "11_05":"Jeremiah 4-6, Psalms 41-42","11_06":"Jeremiah 7-9, Psalms 43-44","11_07":"Jeremiah 10-13, Psalms 45","11_08":"Jeremiah 14-16, Psalms 46-47",
         "11_09":"Jeremiah 17-20, Psalms 48","11_10":"Jeremiah 21-23, Psalms 49-50","11_11":"Jeremiah 24-26, Psalms 51-52","11_12":"Jeremiah 27-29, Psalms 53-54",
         "11_13":"Jeremiah 30-31, Psalms 55-57","11_14":"Jeremiah 32-33, Psalms 58-59","11_15":"Jeremiah 34-36, Psalms 60-61","11_16":"Jeremiah 37-39, Psalms 62-63",
         "11_17":"Jeremiah 40-42, Psalms 64-65","11_18":"Jeremiah 43-45, Psalms 66-67","11_19":"Jeremiah 46-48, Psalms 68-69","11_20":"Jeremiah 49-50, Psalms 70-71",
         "11_21":"Jeremiah 51-52, Psalms 72-74","11_22":"Lamentations 1-2, Psalms 75-77","11_23":"Lamentations 3-5, Psalms 78-79","11_24":"Ezekiel 1-4, Psalms 80",
         "11_25":"Ezekiel 5-7, Psalms 81-82","11_26":"Ezekiel 8-11, Psalms 83","11_27":"Ezekiel 12-14, Psalms 84-85","11_28":"Ezekiel 15-17, Psalms 86-87",
         "11_29":"Ezekiel 18-19, Psalms 88-90","11_30":"Ezekiel 20-22, Psalms 91-92",

         // 12 월
         "12_01":"Ezekiel 23-24, Psalms 93-94","12_02":"Ezekiel 25-27, Psalms 95-96","12_03":"Ezekiel 28-30, Psalms 97-98","12_04":"Ezekiel 31-32, Psalms 99-101",
         "12_05":"Ezekiel 33-35, Psalms 102-103","12_06":"Ezekiel 36-38, Psalms 104-105","12_07":"Ezekiel 39-40, Psalms 106-108","12_08":"Ezekiel 41-43, Psalms 109-110",
         "12_09":"Ezekiel 44-45, Psalms 111-113","12_10":"Ezekiel 46-48, Psalms 114-115","12_11":"Daniel 1-2, Psalms 116-118","12_12":"Daniel 3-4, Psalms 119-121",
         "12_13":"Daniel 5-6, Psalms 122-124","12_14":"Daniel 7-9, Psalms 125-126","12_15":"Daniel 10-12, Psalms 127-128","12_16":"Hosea 1-4",
         "12_17":"Hosea 5-9","12_18":"Hosea 10-14","12_19":"Joel 1-3, Psalms 129-130","12_20":"Amos 1-5",
         "12_21":"Amos 6-9, Psalms 131","12_22":"Obadiah 1 - Jonah 4","12_23":"Micah 1-7","12_24":"Nahum 1-3, Psalms 132-133",
         "12_25":"Habakkuk 1-3, Psalms 134-135","12_26":"Zephaniah 1-3, Psalms 136-137","12_27":"Haggai 1-2, Psalms 138-141","12_28":"Zechariah 1-5, Psalms 142-143",
         "12_29":"Zechariah 6-10, Psalms 144-145","12_30":"Zechariah 11-14, Psalms 146-147","12_31":"Malachi 1-4, Psalms 148-150"
    ]
    
    @IBAction func sendingpageToggleAction(_ sender: UISegmentedControl) {
        switch sendingpageToggle.selectedSegmentIndex{
        case 0:
            sendingeng.isHidden = true
            sendingkor.isHidden = false
            let date = Date()
            let formatter = DateFormatter()
            formatter.dateFormat = "MM_dd"
            let result = formatter.string(from: date)
            sendingTextField.text = sendingSchedule_kor[result]
        case 1:
            sendingeng.isHidden = false
            sendingkor.isHidden = true
            let date = Date()
            let formatter = DateFormatter()
            formatter.dateFormat = "MM_dd"
            let result = formatter.string(from: date)
            sendingTextField.text = sendingSchedule_eng[result]
    
        default:
            break
        }
    }
    
    override func viewDidLoad() {
    super.viewDidLoad()
        let date = Date()
        let formatter = DateFormatter()
        formatter.dateFormat = "MM_dd"
        let result = formatter.string(from: date)
        sendingTextField.textAlignment = .center;
        sendingTextField.text = sendingSchedule_kor[result]
        sendingTextField.font = UIFont(name: "KT&GSangSangTitle", size: 20)

    }
}

